Documents/Бронирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Бронирование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОчередьБронирования</xr:Item>
				<xr:Item>InformationRegister.СтатусыОбъектовНедвижимости</xr:Item>
				<xr:Item>InformationRegister.СрокиБронированияОбъектовНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗапрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьСрокаБронирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацииБронирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляСнятияБронирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомКлик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацииБронирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОперацииБронирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бронирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеБронирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Бронирование/Forms/ФормаДокументаСнятиеБронирования/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗначенияЗаполнения")
			И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") 
			И Параметры.ЗначенияЗаполнения.Свойство("ВидОперации") Тогда
			
		Объект.ВидОперации 	= Параметры.ЗначенияЗаполнения.ВидОперации;	
		ДатаСоздания		= ТекущаяДата();
		Объект.Дата 		= ДатаСоздания;
				
		Если Параметры.ЗначенияЗаполнения.Свойство("ОснованиеДляСнятияБронирования") Тогда
			Объект.ОснованиеДляСнятияБронирования   = Параметры.ЗначенияЗаполнения.ОснованиеДляСнятияБронирования;			
			//<852115>, Басаргин (07.08.2018) {
			Объект.ДомКлик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОснованиеДляСнятияБронирования, "ДомКлик");	
			//<852115> }			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ОбъектНедвижимости) 			
				И Объект.ВидОперации = Перечисления.ВидыОперацииБронирования.СнятиеБронирования 
				И ЗначениеЗаполнено(Объект.ОснованиеДляСнятияБронирования) Тогда
			Объект.ОбъектНедвижимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОснованиеДляСнятияБронирования, "ОбъектНедвижимости");
		КонецЕсли;
				
		Если ЗначениеЗаполнено(Объект.ОснованиеДляСнятияБронирования)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОснованиеДляСнятияБронирования, "ВидОперации") = Перечисления.ВидыОперацииБронирования.СнятиеБронирования Тогда
			Сообщение 			= Новый СообщениеПользователю;
			Сообщение.Текст 	= "Документ снятия с бронирования можно вводить только на основании документа с видом операции ""Бронирование""!";
			Сообщение.Сообщить();
			Отказ				= Истина;
		КонецЕсли;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацииБронирования.СнятиеБронирования
				И НЕ ЗначениеЗаполнено(Объект.ОснованиеДляСнятияБронирования) Тогда
			Отказ = Истина;	
		КонецЕсли;
		
	КонецЕсли;	
	
	////<852115>, Басаргин (08.08.2018) {
	//Элементы.ДомКлик.Доступность = УправлениеДоступом.ЕстьРоль("БронированиеДомКлик", , ПользователиКлиентСервер.АвторизованныйПользователь());
	////<852115> }
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("СобытиеБронирования");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
